core/app/Http/Controllers/CronController.php

select * from `coin_pairs`
---
    public function fakeChart()
    {
        Artisan::call('FChart:cron');

        // iterate on each CoinPair and call ChartController::AddNewCandle()
        $coinPairs = CoinPair::all();