core/app/Http/Controllers/SiteController.php

    public function index()
    {
        if (request()->reference) {
            session()->put('reference', request()->reference);
        }

        $pageTitle    = '';
        $sections     = Page::where('tempname', $this->activeTemplate)->where('slug', '/')->first();
---
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = '/' limit 1

    public function pages($slug)
    {
        $page = Page::where('tempname', $this->activeTemplate)->where('slug', $slug)->firstOrFail();
---
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'orderBookUpdate' limit 1