core/app/Http/Controllers/Gateway/PaymentController.php

    public function wallets()
    {
        $pageTitle = 'Your Receiving Wallets';
        $wallets = Wallet::where('user_id', auth()->id())->with('crypto')->get();
---
select * from `wallets` where `user_id` = 1 order by `created_at` desc

    public function transfer_p2s(Request $request , string $Cid, string $Uid)
    {
        $cryptoCurr = CryptoCurrency::where('id', $Cid)->first();
        // Fetch Spot wallet where user id = $Uid and crypto id = $Cid
        $wallets = spotWallet::where('user_id', $Uid)->where('crypto_currency_id', $Cid)->get();
        $pageTitle = 'Transfer - Spot to P2P';
        $transaction_charges=TransactionCharge::where('id','10')->first()->percent_charge;
---
select * from `crypto_currencies` where `id` = '1' limit 1
select * from `transaction_charges` where `id` = '10' limit 1

    public function transfer_p2p(Request $request,string $Wid) {
        $pageTitle = 'Transfer - P2P to spot';
        $wallets = Wallet::where('id', $Wid)->with('crypto')->first();
        $transaction_charges=TransactionCharge::where('id','11')->first()->percent_charge;
---
select * from `wallets` where `id` = '12' limit 1
select * from `transaction_charges` where `id` = '11' limit 1

    public function transfer_p2p_post(Request $request) {
        $request->validate([
            'amount' => 'required|numeric|min:0',
            'wallets_id' =>'required|numeric',
        ]);

        $wallet = Wallet::where('id',$request->wallets_id)->first();
        $Cid = $wallet->crypto_currency_id;
        $cryptoCurr = CryptoCurrency::where('id', $Cid)->first();
---
select * from `crypto_currencies` where `crypto_currencies`.`id` in (4)