core/app/Http/Controllers/Gateway/PaymentController.php

    public function singleWallet($id, $code)
    {
        $pageTitle = $code . ' Wallets';
        $crypto = CryptoCurrency::findOrFail($id);

        $wallets = Wallet::where('user_id', auth()->user()->id)->with('crypto')->latest()->get();

        $cryptoWallets = CryptoWallet::where('user_id', auth()->user()->id)->where('crypto_currency_id', $crypto->id)->with('crypto')->latest()->take(1)->get();//->paginate(getPaginate());
---
select * from `spot_wallets` where `user_id` = '1' and `crypto_currency_id` = '1'

    public function cryptoIpn(Request $request)
    {
        if ($request->status >= 100 || $request->status == 2) {

            $userCryptoWallet = CryptoWallet::where('wallet_address', $request->address)->first();
            $user = $userCryptoWallet->user;
            $general = gs();

            if ($general->merchant_id == $request->merchant) {

                $exist =  Deposit::where('cp_trx', $request->txn_id)->count();
                if ($exist == 0) {

                    $crypto = CryptoCurrency::find($userCryptoWallet->crypto_currency_id);
---
select * from `crypto_currencies` where `crypto_currencies`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 22, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61)