core/app/Http/Controllers/Admin/AdminController.php

    public function dashboard()
    {

        $pageTitle = 'Dashboard';

        // User Info
        $widget['total_users']             = User::count();
        $widget['verified_users']          = User::active()->where('ev', 1)->where('sv', 1)->count();
        $widget['email_unverified_users']  = User::emailUnverified()->count();
        $widget['mobile_unverified_users'] = User::mobileUnverified()->count();
        $widget['totalAd']                 = Advertisement::count();
        $widget['totalTrade']              = Trade::count();
        $widget['totalCrypto']             = CryptoCurrency::count();
        $widget['totalFiat']               = FiatCurrency::count();
        $widget['total_withdraw_approved'] = Withdrawal::approved()->count();
        $widget['total_withdraw_pending']  = Withdrawal::pending()->count();
        $widget['total_withdraw_rejected'] = Withdrawal::rejected()->count();
        $widget['total_withdraw']          = Withdrawal::where('status', '!=', 0)->count();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `status` = 1 and `ev` = 1 and `sv` = 1
select count(*) as aggregate from `advertisements`
select count(*) as aggregate from `trades`
select count(*) as aggregate from `crypto_currencies`
select count(*) as aggregate from `fiat_currencies`
select count(*) as aggregate from `withdrawals` where `status` != 0



        // user Browsing, Country, Operating Log
        $userLoginData = UserLogin::where('created_at', '>=', Carbon::now()->subDay(30))->get(['browser', 'os', 'country']);
---
select `browser`, `os`, `country` from `user_logins` where `created_at` >= '2022-11-30 21:08:46'