core/app/Http/Controllers/Admin/SpotTransactionChargeController.php

    public function index()
    {
        $pageTitle = "Spot Trading";

        $transaction_charge_spot_to_p2p = TransactionCharge::where('id', '10')->first();
        $transaction_charge_p2p_to_spot = TransactionCharge::where('id', '11')->first();

        $transaction_charge_bot = TransactionCharge::where('id', '12')->first();

        $admin=Admin::where('id','1')->first();

        $crypto_currencies = CryptoCurrency::all();

        $coin_pairs = CoinPair::all();
---
select * from `transaction_charges` where `id` = '10' limit 1
select * from `transaction_charges` where `id` = '11' limit 1
select * from `admins` where `id` = '1' limit 1
select * from `crypto_currencies`
select * from `coin_pairs`