core/app/Console/Commands/FChart.php

select * from `coin_pairs`
select * from `crypto_currencies` where `id` = '1' limit 1
select * from `crypto_currencies` where `id` = '4' limit 1
select * from `fake_spot_charts` where `coin_pair_id` = 39 order by `timeframe` desc limit 1
---
    public function handle()
    {

        $coin_pairs = CoinPair::all();

        foreach ($coin_pairs as $coin_pair) {
            $base_coin = CryptoCurrency::where('id', $coin_pair->crypto_currency_id)->first();
            $quote_coin = CryptoCurrency::where('id', $coin_pair->CryptoCurrency_id1)->first();

            $price = $base_coin->rate / $quote_coin->rate;


            if ($price < 1) {
                $val = 10000000000;
            } else {
                $val = 100;
            }

            $timestamp = FakeSpotChart::where('coin_pair_id', $coin_pair->id)->orderBy('timeframe', 'desc')->first()->timeframe + 60;

            $last_close = FakeSpotChart::where('coin_pair_id', $coin_pair->id)->orderBy('timeframe', 'desc')->first()->close;

insert into `fake_spot_charts` (`coin_pair_id`, `open`, `high`, `low`, `close`, `timeframe`, `updated_at`, `created_at`) values (39, '21768.18', 21867.09, 21534.45, 21542.03, 1679722286, '2023-03-24 11:50:36', '2023-03-24 11:50:36')
---

                $fakeSpotChart->timeframe = $timestamp;

                $fakeSpotChart->save();