core/app/Http/Controllers/Spot/Api/SpotOrdersController.php

select * from `coin_pairs` order by `id` asc
---
    public function pairs()
    {
        $coinPairs = CoinPair::orderBy('id', 'asc')->get();

select * from `coin_pairs` where `id` = '40' limit 1
select `open`, `high`, `low`, `close`, timeframe as time from `fake_spot_charts` where `coin_pair_id` = '40' and `timeframe` <= 1681043702 order by `timeframe` asc limit 200
select * from `coin_pairs`
select * from `crypto_currencies` where `id` = '1' limit 1
select * from `crypto_currencies` where `id` = '4' limit 1
(select `id`, `created_at`, `coin_pair_id`, `action`, `status`, `price`, `amount`, `filled`, 'Market' as type from `spot_markets` where `coin_pair_id` = '40' and `user_id` = 1) union (select `id`, `created_at`, `coin_pair_id`, `action`, `status`, `price`, `amount`, `filled`, 'Limit' as type from `spot_limits` where `coin_pair_id` = '40' and `user_id` = 1) union (select `id`, `created_at`, `coin_pair_id`, `action`, `status`, `price`, `amount`, `filled`, 'SpotLimit' as type from `spot_stop_limits` where `coin_pair_id` = '40' and `user_id` = 1) order by `created_at` desc
---
    public function create(Request $request, string $pair){
        $singlePair = CoinPair::where('id', $pair)->first();

        // only to be sent when fake spot charts have been enabled
        // send chart on the basis of the pair option whether fake or orignal has been selected.
        if ($singlePair->fake ==1){
            $chart = DB::table('fake_spot_charts')->select('open', 'high', 'low', 'close', DB::raw('timeframe as time'))->where('coin_pair_id', $pair)->where('timeframe', '<=', now()->timestamp)->orderBy('timeframe', 'asc')->take(200)->get();
        }
        else{
            $chart = DB::table('spot_charts')->select('open', 'high', 'low', 'close', DB::raw('timeframe as time'))->where('coin_pair_id', $pair)->where('open','!=', null)->where('timeframe', '<=', now()->timestamp)->orderBy('timeframe', 'asc')->get();
        }

        $coinPairs = CoinPair::all();

        $cryptoCurrency1 =CryptoCurrency::where('id', $singlePair->crypto_currency_id)->first();
        $cryptoCurrency2 = CryptoCurrency::where('id', $singlePair->CryptoCurrency_id1)->first();

        $price=$cryptoCurrency1->rate / $cryptoCurrency2->rate;

        $cryptoBalance1 = spotWallet::where('user_id', auth()->id())->where('crypto_currency_id', $singlePair->crypto_currency_id)->first()->available_balance ?? 0;

        $cryptoBalance2 = spotWallet::where('user_id', auth()->id())->where('crypto_currency_id', $singlePair->CryptoCurrency_id1)->first()->available_balance ?? 0;

        $orderMarket = SpotMarket::select('id', 'created_at', 'coin_pair_id', 'action', 'status', 'price', 'amount', 'filled', DB::raw("'Market' as type"))->where('coin_pair_id', $pair)->where('user_id', auth()->id());

        $orderLimit = SpotLimit::select('id', 'created_at', 'coin_pair_id', 'action', 'status', 'price', 'amount', 'filled', DB::raw("'Limit' as type"))->where('coin_pair_id', $pair)->where('user_id', auth()->id());
        $orderStopLimit = SpotStopLimit::select('id', 'created_at', 'coin_pair_id', 'action', 'status', 'price', 'amount', 'filled', DB::raw("'StopLimit' as type"))->where('coin_pair_id', $pair)->where('user_id', auth()->id());

        $AllOrders = $orderMarket->union($orderLimit)->union($orderStopLimit)->orderBy('created_at', 'desc')->get();

select * from `spot_limits` where `coin_pair_id` = '40' and `status` = 'open'
---
            array_push($allOrders,$oneOrder);
        }

        $orderBook = SpotLimit::where('coin_pair_id', $pair)->where('status','open')->get();