core/app/Http/Controllers/Spot/Api/TrasactionController.php

select * from `wallets` where `user_id` = 1
select * from `transaction_charges` where `id` = '11' limit 1
---
    public function transfer_p2p(Request $request) {
        // $pageTitle = 'Transfer - P2P to spot';
        // $wallets = Wallet::where('user_id', auth()->id())->with('crypto')->get();
        $wallets = Wallet::where('user_id', auth()->id())->with('crypto')->get();
        $wnames=array();
        $wids=array();
        foreach ($wallets as $wallet) {
            if ($wallet->balance!=0) {
                array_push($wnames,$wallet->crypto->code);
                $wids[$wallet->crypto->code]=['id'=>$wallet->id,'balance'=>$wallet->balance/$wallet->crypto->rate];
            }

        }
        $transaction_charges=TransactionCharge::where('id','11')->first()->percent_charge;