core/app/Http/Controllers/Spot/ChartController.php

    public static function AddNewCandle(string $pair)
    {
        $lastCandle = SpotChart::where('coin_pair_id', $pair)->orderBy('timeframe', 'desc')->first();

        $spotChart = new SpotChart();
        $spotChart->coin_pair_id = $pair;

        // Adding first candle
        if($lastCandle == null){
            $spotChart->timeframe = now()->timestamp;
            $spotChart->save();
            return;
        }


        $spotChart->timeframe = $lastCandle->timeframe + 300;
        $spotChart->save();
---
select * from `spot_charts` where `coin_pair_id` = '39' order by `timeframe` desc limit 1
insert into `spot_charts` (`coin_pair_id`, `timeframe`, `updated_at`, `created_at`) values ('39', 1679630707, '2023-03-24 11:50:36', '2023-03-24 11:50:36')