core/app/Http/Controllers/Spot/OrderBookController.php

select * from `coin_pairs` where `id` = '39' limit 1
select `open`, `high`, `low`, `close`, timeframe as time from `fake_spot_charts` where `coin_pair_id` = '39' and `timeframe` <= 1679618239 order by `timeframe` asc
select `open`, `high`, `low`, `close`, timeframe as time from `spot_charts` where `coin_pair_id` = '39' and `open` is null and `timeframe` <= 1679595897 order by `timeframe` asc
select * from `coin_pairs`
select * from `crypto_currencies` where `id` = '4' limit 1
select * from `spot_limits` where `coin_pair_id` = '39' and `status` = 'open'
---
    public function guestcreate(Request $request, string $pair)
    {

        $singlePair = CoinPair::where('id', $pair)->first();

        // only to be sent when fake spot charts have been enabled
        // send chart on the basis of the pair option whether fake or orignal has been selected.
        if ($singlePair->fake ==1){
            $chart = DB::table('fake_spot_charts')->select('open', 'high', 'low', 'close', DB::raw('timeframe as time'))->where('coin_pair_id', $pair)->where('timeframe', '<=', now()->timestamp)->orderBy('timeframe', 'asc')->get();
        }
        else{
            $chart = DB::table('spot_charts')->select('open', 'high', 'low', 'close', DB::raw('timeframe as time'))->where('coin_pair_id', $pair)->where('open','!=', null)->where('timeframe', '<=', now()->timestamp)->orderBy('timeframe', 'asc')->get();
        }

        $coinPairs = CoinPair::all();

        $cryptoCurrency1 =CryptoCurrency::where('id', $singlePair->crypto_currency_id)->first();
        $cryptoCurrency2 = CryptoCurrency::where('id', $singlePair->CryptoCurrency_id1)->first();


        $pageTitle = 'Exchange';
        $orderBook = SpotLimit::where('coin_pair_id', $pair)->where('status','open')->get();

select * from `coin_pairs` where `id` = '40' limit 1
select `open`, `high`, `low`, `close`, timeframe as time from `fake_spot_charts` where `coin_pair_id` = '40' and `timeframe` <= 1681054895 order by `timeframe` asc
select * from `coin_pairs`
select * from `crypto_currencies` where `id` = '1' limit 1
select * from `crypto_currencies` where `id` = '4' limit 1
---
    public function create(Request $request, string $pair)
    {

        $singlePair = CoinPair::where('id', $pair)->first();

        // only to be sent when fake spot charts have been enabled
        // send chart on the basis of the pair option whether fake or orignal has been selected.
        if ($singlePair->fake ==1){
            $chart = DB::table('fake_spot_charts')->select('open', 'high', 'low', 'close', DB::raw('timeframe as time'))->where('coin_pair_id', $pair)->where('timeframe', '<=', now()->timestamp)->orderBy('timeframe', 'asc')->get();
        }
        else{
            $chart = DB::table('spot_charts')->select('open', 'high', 'low', 'close', DB::raw('timeframe as time'))->where('coin_pair_id', $pair)->where('open','!=', null)->where('timeframe', '<=', now()->timestamp)->orderBy('timeframe', 'asc')->get();
        }

        $coinPairs = CoinPair::all();

        $cryptoCurrency1 =CryptoCurrency::where('id', $singlePair->crypto_currency_id)->first();
        $cryptoCurrency2 = CryptoCurrency::where('id', $singlePair->CryptoCurrency_id1)->first();

select * from `spot_limits` where `coin_pair_id` = '40' and `status` = 'open'
---

        $allOrders = $orderMarket->union($orderLimit)->union($orderStopLimit)->orderBy('created_at', 'desc')->get();

        $orderBook = SpotLimit::where('coin_pair_id', $pair)->where('status','open')->get();

select * from `coin_pairs` where `id` = '40' limit 1
select `open`, `high`, `low`, `close`, timeframe as time from `fake_spot_charts` where `coin_pair_id` = '40' and `timeframe` = 1680983243 order by `timeframe` desc
---
    public function GetData(Request $request, string $pair, string $time)
    {
        // convert string to int of 8 byte



        $coinpair = CoinPair::where('id', $pair)->first();
        if ($coinpair->fake ==1){
            $time = (int)$time + 60;
            $chart = DB::table('fake_spot_charts')->select('open', 'high', 'low', 'close', DB::raw('timeframe as time'))->where('coin_pair_id', $pair)->where('timeframe', $time)->orderBy('timeframe', 'desc')->get();